# b1 = int(input())
# q = int(input())
# n = int(input())
#
# print(b1 * q ** (n-1))

# Количество целых метров в сантиметрах
# x = int(input())
# print(x//100)

# # Целочисленный результат и остаток
# n = int(input())
# k = int(input())
#
# print(k//n)
# print(k%n)

# Щелчок Таноса
# n = int(input())
#
# print(-((-n)//2))

# Место в вагоне
# n = int(input())
#
# print(-((-n)//4))

# Количество часов и минут
# t = int(input())
#
# print(f"{t} мин - это {t//60} час {t%60} минут.")

# Расчет суммы и произведений чисел
# n = int(input())
#
# print(f"Сумма цифр = {n//100 + (n%100)//10 + n%10}")
# print(f"Произведение цифр = {(n//100) * ((n%100)//10) * (n%10)}")

# Перестановка цифр
# n = int(input())
# a = n//100
# b = (n%100)//10
# c = n%10
#
# print(a,b,c,sep='')
# print(a,c,b,sep='')
# print(b,a,c,sep='')
# print(b,c,a,sep='')
# print(c,a,b,sep='')
# print(c,b,a,sep='')

# Четырёхзначное число
n = int(input())

print(f"Цифра в позиции тысяч равна {(n%10**4)//(10**3)}")
print(f"Цифра в позиции сотен равна {(n%10**3)//(10**2)}")
print(f"Цифра в позиции десятков равна {(n%10**2)//(10**1)}")
print(f"Цифра в позиции единиц равна {(n%10**1)//(10**0)}")

