# n = int(input())
# k = int(input())
#
# if n>k:
#     print('NO')
# elif n<k:
#     print('YES')
# else:
#     print("Don't know")

# Напишите программу, которая принимает три положительных числа и определяет вид треугольника, длины сторон которого равны введенным числам.
# a = int(input())
# b = int(input())
# c = int(input())
#
#
# if a==b==c:
#     print('Равносторонний')
# elif a==b or a==c or b==c:
#     print('Равнобедренный')
# else:
#     print("Разносторонний")

# Даны три различных целых числа. Напишите программу, которая находит среднее по величине число.
